app/controllers/comments_controller.rb

SELECT `comments`.* FROM `comments`
---
  def index
    @comments = Comment.all

INSERT INTO `comments` (`body`, `user_id`, `post_id`, `created_at`, `updated_at`) VALUES ('sjdjfcsj', 1, 5, '2018-03-11 14:33:43', '2018-03-11 14:33:43')
---
  def create
    unless current_user
      flash[:alert] = "Please sign in or sign up first"
      redirect_to new_user_session_path
    else
      @comments = @post.comments
      @comment = @post.comments.create(comment_params)

DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
    unless current_user
      flash[:alert] = "Please sign in or sign up first"
      redirect_to new_user_session_path
    else
      @comment.destroy

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = NULL LIMIT 1
---
    def set_comment
      @comment = Comment.find(params[:id])

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 5 ORDER BY `posts`.`created_at` DESC LIMIT 1
---
    def set_post
      @post = Post.find(params[:post_id])