app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC

  def create
    @post = Post.new(post_params)
    @post.user = current_user
    @post.save
---
INSERT INTO `posts` (`title`, `body`, `user_id`, `created_at`, `updated_at`) VALUES ('hellol', 'jajjdjasd', 1, '2018-03-10 17:03:17', '2018-03-10 17:03:17')

  def update
    unless @post.user === current_user
      flash_message = "Only the owner can edit the post."
      flash[:alert] = flash_message
      redirect_to posts_index_path
    else
      if @post.update(post_params)
---
UPDATE `posts` SET `title` = 'jsdjjsjfjsdasdasd', `body` = 'jjsjfjsdjfsdjfjsdfsdasdas', `updated_at` = '2018-03-10 21:15:45' WHERE `posts`.`id` = 2

  def destroy
    unless @post.user === current_user
      flash_message = "You can not delete the Post."
      flash[:alert] = flash_message
      redirect_to @post
    else
      if @post.destroy
---
DELETE FROM `posts` WHERE `posts`.`id` = 3

    def set_post
      @post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 3 ORDER BY `posts`.`created_at` DESC LIMIT 1